Repository: clairvy/perl6-doc-ja
Catalog: perl6-doc-ja-level2.tmx
Source language: en_us
Languages: ja

source: (Another way to look at it is that the type instantiation "factory" is memoized.) Typename aliases are considered equivalent to the original type.
ja: (それを調べるもう一つの方法は、型をインスタンス化するファクトリーがメモ化されることです。)型名の別名は元の型と同等とみなされます。

source: In particular, the Array of Int syntax is just sugar for Array:of(Int), which is the canonical form of an instantiated generic type.
ja: 特にArray of Intという構文はインスタンス化されたジェネリックタイプの正規形であるArray:of(Int)の単なるシュガーです。

source: This name equivalence of parametric types extends only to parameters that can be considered immutable (or that at least can have an immutable snapshot taken of them).
ja: このパラメータを伴う型の名前の等価性は不変(または少なくとも不変のスナップショットを撮ることが出来る)とみなせるパラメータだけを拡張します。

source: Two distinct classes are never considered equivalent even if they have the same attributes because classes are not considered immutable.
ja: 別個の2つのクラスはたとえ同じ属性を持っていても決して同等とは見なされません。なぜならクラスは不変とみなされないからです。

source: Perl 6 supports the notion of properties on various kinds of objects.
ja: Perl 6は様々な種類のオブジェクトでプロパティの概念をサポートします。

source: Properties are like object attributes, except that they're managed by the individual object rather than by the object's class.
ja: オブジェクトのクラスではなく個々のオブジェクトに管理されている場合を除いて、プロパティはオブジェクトの属性に似ています。

source: According to S12, properties are actually implemented by a kind of mixin mechanism, and such mixins are accomplished by the generation of an individual anonymous class for the object (unless an identical anonymous class already exists and can safely be shared).
ja: S12に従って、プロパティは実際にはミックスインメカニズムのようなもので実装され、そのようなミックスインはオブジェクトに対する個々の無名クラスの生成によって完成します(同じ無名クラスがまだ存在せず、安全に共有できるのであれば)。

source: Properties applied to objects constructed at compile-time, such as variables and classes, are also called traits.
ja: プロパティはコンパイル時に構成される変数やクラスなどに適用され、トレイトとも呼ばれます。

source: Traits cannot be changed at run-time.
ja: トレイトを実行時に変更することは出来ません。

source: Changes to run-time properties are done via mixin instead, so that the compiler can optimize based on declared traits.
ja: 実行時のプロパティの変更は代わりにミックスインによって行われます。これによってコンパイラーは宣言されたトレイトを元に最適化することが出来ます。

source: Perl 6 is an OO engine, but you're not generally required to think in OO when that's inconvenient.
ja: Perl 6はオブジェクト指向エンジンですが、都合が悪いならオブジェクト指向で考える必要はありません。

source: However, some built-in concepts such as filehandles will be more object-oriented in a user-visible way than in Perl 5.
ja: しかし、ファイルハンドルのようないくつかのビルトインの概念はPerl 5以上にユーザーに見える形でオブジェクト指向的になるでしょう。

source: A variable's type is a constraint indicating what sorts of values the variable may contain.
ja: 変数の型とは、変数がどのような値を含む可能性があるかを示す制約です。

source: More precisely, it's a promise that the object or objects contained in the variable are capable of responding to the methods of the indicated "role".
ja: より正確には、オブジェクトまたは変数に格納されたオブジェクトがroleで示されたメソッドに応答できることの保証です。

source: See S12 for more about roles.
ja: 詳細についてはS12を参照して下さい。

source: A variable may itself be bound to a container type that specifies how the container works, without specifying what kinds of things it contains.
ja: 変数自体はどの種類のものを含むか指定せず、どのように動作するかを指定するコンテナ型にバインドされます。

source: Constraints and container types can be used together:
ja: 制約とコンテナ型は一緒に使用することができます:

source: Note that $x is also initialized to the Int type object.
ja: $xがInt型オブジェクトで初期化されることにも注意して下さい。

source: See below for more on this.
ja: これについて詳しくは以下を見て下さい。

source: my Dog $spot by itself does not automatically call a Dog constructor.
ja: my Dog $spot自体はDogのコンストラクターを自動で呼びません。

source: It merely assigns an undefined Dog prototype object to $spot:
ja: それは単に未定義のDogプロトタイプオブジェクトを$spotに割り当てます:

source: Any type name used as a value is an undefined instance of that type's prototype object, or type object for short.
ja: 値として使われる任意の型名はその型の未定義のプロトタイプオブジェクト、短くはタイプオブジェクトのインスタンスです。

source: See S12 for more on that.
ja: それの詳細についてはS12を参照して下さい。

source: Any type name in rvalue context is parsed as a single type value and expects no arguments following it.
ja: 右辺コンテキストでの型名は単独の型の値としてパースされ、それに続く引数がないことを期待します。

source: However, a type object responds to the function call interface, so you may use the name of a type with parentheses as if it were a function, and any argument supplied to the call is coerced to the type indicated by the type object.
ja: しかしタイプオブジェクトは関数呼び出しインターフェースに応答するので、あなたは型の名前を括弧と一緒に関数であるかのように使用するでしょう。そして呼び出しに供給されるどんな引数もタイプオブジェクトの示す型に強制されます。

source: If there is no argument in the parentheses, the type object returns itself:
ja: もしも括弧に引数が無いなら、タイプオブジェクト自身を返します:

source: To get a real Dog object, call a constructor method such as new:
ja: 本当のDogオブジェクトを得るために、newのようなコンストラクタメソッドを呼んで下さい:

source: You can pass in arguments to the constructor as well:
ja: 同様にコンストラクタに引数を渡すことも出来ます:

source: If you say
ja: もしあなたが次のようにするなら:

source: you are declaring that the elements of @array are native integers, but that the array itself is implemented by the MyArray class.
ja: @arrayの要素をネイティブ整数と宣言しますが、配列自身はMyArrayクラスで実装されます。

source: Untyped arrays and hashes are still perfectly acceptable, but have the same performance issues they have in Perl 5.
ja: 型指定されていない配列とハッシュはいまだに何でも受け入れますが、Perl 5と同じパフォーマンスの問題を持っています。

source: To get the number of elements in an array, use the .elems method.
ja: 配列の要素数を得るには.elemsメソッドを使用して下さい。

source: You can also ask for the total string length of an array's elements, in bytes, codepoints or graphemes, using these methods .bytes, .codes or .graphs respectively on the array.
ja: また、.bytes、.codes、.graphsメソッドを使用してバイト、コードポイント、書記素でそれぞれの配列要素の文字列の長さの合計を求めることが出来ます。

source: The same methods apply to strings as well.
ja: 同様に文字列にも同じメソッドを適用します。

source: (Note that .bytes is not guaranteed to be well-defined when the encoding is unknown.
ja: (.bytesはエンコーディングが不明な場合は明確には保証されないので注意して下さい。

source: Similarly, .codes is not well-defined unless you know which canonicalization is in effect.
ja: 同様に、.codesはどの正規化が有効なのか不明な場合は明確ではありません。

source: Hence, both methods allow an optional argument to specify the meaning exactly if it cannot be known from context.)
ja: そのため、両方のメソッドはコンテキストから知ることができない場合に正確な意味を指定するための任意の引数を受け入れます。)

source: There is no .length method for either arrays or strings, because length does not specify a unit.
ja: .lengthメソッドは配列と文字列のどちらにもありません。なぜならlengthは単位を指定しないからです。

source: Built-in object types start with an uppercase letter.
ja: ビルトインオブジェクト型は大文字で始まります。

source: This includes immutable types (e.g. Int, Num, Complex, Rat, Str, Bit, Regex, Set, Block, List, Seq), as well as mutable (container) types, such as Scalar, Array, Hash, Buf, Routine, Module, and non-instantiable Roles such as Callable, Failure, and Integral.
ja: これは変更不可の型を含みます(Int、Num、Complex、Rat、Str、Bit、Regex、Set、Block、List、Seqなど)。変更可能な(コンテナ)型も同様です。Scalar、Array、Hash、Buf、Routine、Moduleなど。そしてインスタンス化できないCallable、Failure、Integralなども同様です。

source: Non-object (native) types are lowercase: int, num, complex, rat, buf, bit.
ja: オブジェクトでない(ネイティブ)型は小文字です: int、num、complex、rat、buf、bit。

source: Native types are primarily intended for declaring compact array storage.
ja: ネイティブ型は主にコンパクトな配列ストレージを宣言するためのものです。

source: However, Perl will try to make those look like their corresponding uppercase types if you treat them that way.
ja: しかし、Perlはそれらを対応する大文字の型のように扱えるようにしようとします。

source: (In other words, it does autoboxing.
ja: (言い換えれば、自動ボックス化を行います。

source: Note, however, that sometimes repeated autoboxing can slow your program more than the native type can speed it up.)
ja: しかし、自動ボックス化の繰り返しがネイティブ型のスピードアップ以上にプログラムを遅くすることもあるので注意して下さい。)

source: The junction type is considered a native type because its internal representation is fixed, and you may not usefully derive from it because the intent of junctions is to autothread any method calls on them.
ja: 内部表現が固定されているので、junction型はネイティブ型と見なされます。そしてjunctionの意図はあらゆるメソッド呼び出しを自動スレッド化することなので、それから有益に派生させることはできないでしょう。

source: Some object types can behave as value types.
ja: いくつかのオブジェクトは値型として振る舞うことが出来ます。

source: Every object can produce a "WHICH" value that uniquely identifies the object for hashing and other value-based comparisons.
ja: 全てのオブジェクトはハッシュと値ベースの比較のために一意に識別するためのWHICH値を出力できます。

source: Normal objects just use their address in memory, but if a class wishes to behave as a value type, it can define a .WHICH method that makes different objects look like the same object if they happen to have the same contents.
ja: 通常のオブジェクトはそれらのメモリアドレス使うだけですが、クラスが値型として振る舞いたい場合に、異なるオブジェクトが同じ内容を持つ場合が発生するなら同じオブジェクトのように見せる.WHICHメソッドを定義できます。

source: Variables with non-native types can always contain undefined values, such as Object, Whatever and Failure objects.
ja: 非ネイティブ型を伴う変数は常にObject、Whatever、Failureオブジェクトなどのundefined値を含むことが出来ます。

source: See S04 for more about failures (i.e. unthrown exceptions):
ja: failures(例えばunthrown exceptionsなど)の詳細についてはS04を参照して下さい:

source: Variables with native types do not support undefinedness: it is an error to assign an undefined value to them:
ja: ネイティブ型を伴う変数は未定義をサポートしません: 未定義値をそれらに割り当てるとエラーになります:

source: Conjecture: num might support the autoconversion of undef to NaN, since the floating-point form can represent this concept.
ja: 推測: numはundefからNaNへの自動変換をサポートするかもしれないので、浮動小数点形式はこの概念を表現できます。

source: Might be better to make that conversion optional though, so that the rocket designer can decide whether to self-destruct immediately or shortly thereafter.
ja: ロケットの設計者が自己破壊を即座に行うかその後間もなく行うか決めることが出来るように、その変換を任意に出来るなら良いかもしれません。

source: Variables of non-native types start out containing an undefined value unless explicitly initialized to a defined value.
ja: 非ネイティブ型は明示的に定義された値で初期化されなければ未定義値になります。

source: Every object supports a HOW function/method that returns the metaclass instance managing it, regardless of whether the object is defined:
ja: 全てのオブジェクトは、オブジェクトが定義されているかどうかに関わらずそれを管理するメタクラスのインスタンスを返すHOW関数/メソッドをサポートします:

source: (For a prototype system (a non-class-based object system), all objects are merely managed by the same meta object.)
ja: (プロトタイプシステム(クラスベースでないオブジェクトシステム)のために、全てのオブジェクトは単に同じメタオブジェクトによって管理されます。)

source: Perl 6 intrinsically supports big integers and rationals through its system of type declarations.
ja: Perl 6は型宣言のシステムを通してbig integersとbig rationalsを本質的にサポートします。

source: Int automatically supports promotion to arbitrary precision, as well as holding Inf and NaN values.
ja: IntはInf値とNaN値を保持するのと同様に任意の精度への昇格を自動的にサポートします。

source: Note that Int assumes 2's complement arithmetic, so +^1 == -2 is guaranteed.
ja: Intは2の補数演算を想定することに注意して下さい。なので+^1 == -2が保証されています。

source: (Native int operations need not support this on machines that are not natively 2's complement.
ja: (ネイティブのint演算は2の補数をネイティブにサポートしていないマシンではサポートする必要はありません。

source: You must convert to and from Int to do portable bitops on such ancient hardware.)
ja: あなたはIntへの変換や逆のことをそのような古いハードウェアで移植性のあるビット演算に出来るようにしなければなりません。

source: (Num may support arbitrary-precision floating-point arithmetic, but is not required to unless we can do so portably and efficiently.
ja: (Numは任意の精度の浮動小数点演算をサポートします。しかし移植性があり効率的に行うことが出来ないのであれば必要有りません。

source: Num must support the largest native floating point format that runs at full speed.)
ja: Numは最も大きいネイティブ浮動小数点フォーマットをフルスピードで実行できるようにサポートしなければなりません。)

source: Rat supports arbitrary precision rational arithmetic.
ja: Ratは任意の精度の有理数演算をサポートします。

source: However, dividing two Int objects using infix: produces a fraction of Num type, not a ratio.
ja: しかし、2つのIntオブジェクトをinfix:で除算するとレシオではなくNum型の端数を生成します。

source: You can produce a ratio by using infix:<div> on two integers instead.
ja: 代わりにinfix:<div>を使ってレシオを生成できます。

source: Lower-case types like int and num imply the native machine representation for integers and floating-point numbers, respectively, and do not promote to arbitrary precision, though larger representations are always allowed for temporary values.
ja: int、numのような小文字型はマシンネイティブの整数と浮動小数点表現を意味します。それぞれは任意の精度へ昇格しませんが、テンポラリ値についてはより大きい表現が常に許可されます。

source: Unless qualified with a number of bits, int and num types represent the largest native integer and floating-point types that run at full speed.
ja: ビット数で制限されなければ、intとnum型はフルスピードで実行される最も大きな整数と浮動小数点を表現します。

source: Numeric values in untyped variables use Int and Num semantics rather than int and num.
ja: 型のない変数での数値はIntとNumをintとnumより優先して使用します。

source: Perl 6 should by default make standard IEEE floating point concepts visible, such as Inf (infinity) and NaN (not a number).
ja: Perl 6はデフォルトでInf(無限)とNaN(数でない)のような標準のIEEE小数点概念を見えるようにするべきです。

source: Within a lexical scope, pragmas may specify the nature of temporary values, and how floating point is to behave under various circumstances.
ja: レキシカルスコープ内でプラグマはテンポラリ値の性質、そして様々な環境下で浮動小数点がどの様に振る舞うか指定します。

source: All IEEE modes must be lexically available via pragma except in cases where that would entail heroic efforts to bypass a braindead platform.
ja: うまく機能しないプラットフォームを回避するために壮大な努力を必要とする場合を除いて、全てのIEEEモードがプラグマによってレキシカルに使用可能でなければなりません。

source: The default floating-point modes do not throw exceptions but rather propagate Inf and NaN.
ja: デフォルトの浮動小数点モードは例外をスローするのではなくInfとNaNを伝播します。

source: The boxed object types may carry more detailed information on where overflow or underflow occurred.
ja: ボックス化されたオブジェクト型はオーバーフローかアンダーフローが発生したところでより詳細な情報を伝達します。

source: Numerics in Perl are not designed to give the identical answer everywhere.
ja: Perlでの計算法はどこでも同じ答えを与えるように設計されていません。

source: They are designed to give the typical programmer the tools to achieve a good enough answer most of the time.
ja: それらは一般的なプログラマーにほとんどの場合十分な答えを果たすツールを与えるように設計されています。

source: (Really good programmers may occasionally do even better.) Mostly this just involves using enough bits that the stupidities of the algorithm don't matter much.
ja: (本当によいプログラマーは時折もっと良く改善します。)大抵、これは重要でないアルゴリズムの愚行に十分なビットの使用を引き起こすだけです。

source: A Str is a Unicode string object.
ja: Strはユニコード文字列オブジェクトです。

source: There is no corresponding native str type.
ja: 対応するネイティブstr型はありません。

source: However, since a Str object may fill multiple roles, we say that a Str keeps track of its minimum and maximum Unicode abstraction levels, and plays along nicely with the current lexical scope's idea of the ideal character, whether that is bytes, codepoints, graphemes, or characters in some language.
ja: しかしStrオブジェクトは複数のロールを果たすので、Strはユニコードの抽象レベルで最小と最大のトラックを保持します。そしてバイト、コードポイント、 書記素またはいくつかの言語の文字であるかどうか、現在のレキシカルスコープの理想的な文字のアイデアに沿ってうまく演じます。

source: For all builtin operations, all Str positions are reported as position objects, not integers.
ja: 全てのビルトイン操作について、全てのStrポジションは整数ではなくポジションオブジェクトとして報告されます。

source: These StrPos objects point into a particular string at a particular location independent of abstraction level, either by tracking the string and position directly, or by generating an abstraction-level independent representation of the offset from the beginning of the string that will give the same results if applied to the same string in any context.
ja: これらStrPosオブジェクトは特定の文字列の特定の場所を抽象レベルに依存せずポイントします。文字列と位置を直接に追跡するか、あらゆるコンテキストで同じ文字列に適用された場合に同じ結果を与える文字列の開始オフセットを抽象レベルに依存しない表現で出力するかどちらかです。

source: This is assuming the string isn't modified in the meanwhile; a StrPos is not a "marker" and is not required to follow changes to a mutable string.
ja: これは一方で文字列が変更されないと仮定しています; StrPosはマーカーではなく、可変の文字列の変更を追跡する必要はありません。

source: For instance, if you ask for the positions of matches done by a substitution, the answers are reported in terms of the original string (which may now be inaccessible!), not as positions within the modified string.
ja: 例えば、置換された文字列のマッチする位置を求めるとしたら、その答えは変更された文字列のポジションではなく元の文字列のものとして報告されます(今はアクセスできないかもしれません！)。

source: The subtraction of two StrPos objects gives a StrLen object, which is also not an integer, because the string between two positions also has multiple integer interpretations depending on the units.
ja: 2つのStrPosオブジェクトの減算はStrLenオブジェクトを与えます。それも整数ではありません。なぜなら2つのポジション間の文字列も単位に依存する複数の整数解釈を持つからです。

source: A given StrLen may know that it represents 18 bytes, 7 codepoints, 3 graphemes, and 1 letter in Malayalam, but it might only know this lazily because it actually just hangs onto the two StrPos endpoints within the string that in turn may or may not just lazily point into the string.
ja: 与えられたStrLenは18バイト、7コードポイント、3書記素、そしてマラヤーラムの1文字を表現すると知っているでしょう。しかしそれはいい加減にしか知っていないかもしれません。なぜならそれは文字列を単にいい加減にポイントするかしていない文字列内の2つのStrPosの終点を捕まえているだけだからです。

source: (The lazy implementation of StrLen is much like a Range object in that respect.)
ja: (その点に関してStrLenのいいかげんな実装はRangeオブジェクトにそっくりです。)

source: If you use integers as arguments where position objects are expected, it will be assumed that you mean the units of the current lexically scoped Unicode abstraction level.
ja: ポジションオブジェクトが期待されるところで整数を引数として使用すると、現在のレキシカルスコープのユニコード抽象レベルの単位を意味すると見なされます。

source: (Which defaults to graphemes.) Otherwise you'll need to coerce to the proper units:
ja: (デフォルトは書記素です。)それ以外は適切な単位を強制する必要があります:

source: Of course, such a dimensional number will fail if used on a string that doesn't provide the appropriate abstraction level.
ja: もちろんそのような次元数は文字列が適切な抽象レベルを提供しないなら失敗するでしょう。

source: If a StrPos or StrLen is forced into a numeric context, it will assume the units of the current Unicode abstraction level.
ja: StrPosかStrLenが数値コンテキストを強制されると、現在のユニコード抽象レベルの単位と見なされます。

source: It is erroneous to pass such a non-dimensional number to a routine that would interpret it with the wrong units.
ja: そのような次元的でない数を間違った単位で解釈するルーチンに渡すのは誤っています。

source: Implementation note: since Perl 6 mandates that the default Unicode processing level must view graphemes as the fundamental unit rather than codepoints, this has some implications regarding efficient implementation.
ja: 実装上の注意: Perl 6はデフォルトのユニコード処理レベルをコードポイントよりも書記素を基本単位として見なければならないと命じるので、これは効率的な実装に注意を払ういくつかの意味合いを持っています。

source: It is suggested that all graphemes be translated on input to a unique grapheme numbers and represented as integers within some kind of uniform array for fast substr access.
ja: substrアクセスを高速化するため、いくつかの種類の均一な配列内で全ての書記素のインプットを固有の書記素数に変換し、整数として表現することが推奨されます。

source: For those graphemes that have a precomposed form, use of that codepoint is suggested.
ja: これらの構成済みの形式を持つ書記素のために、そのコードポイントを使うことが推奨されます。

source: (Note that this means Latin-1 can still be represented internally with 8-bit integers.)
ja: (これは、Latin-1がいまだに内部的に8ビット整数で表現されることができることに注意して下さい。)

source: For graphemes that have no precomposed form, a temporary private id should be assigned that uniquely identifies the grapheme.
ja: 構成済みの形式を持たない書記素のために、テンポラリのプライベートIDは書記素を固有に識別するように割り当てられるべきです。

source: If such ids are assigned consistently thoughout the process, comparison of two graphemes is no more difficult than the comparison of two integers, and comparison of base characters no more difficult than a direct lookup into the id-to-NFD table.
ja: このようなIDが処理を通して一貫して割り当てられるなら、2つの書記素の比較はもはや2つの整数の比較より難しくありません。そして基本文字の比較はもはやid-to-NFDテーブル内の直接検索より難しくありません。

source: Obviously, any temporary grapheme ids must be translated back to some universal form (such as NFD) on output, and normal precomposed graphemes may turn into either NFC or NFD forms depending on the desired output.
ja: もちろん、あらゆるテンポラリ書記素IDはいくつかの普遍的な形式(NFDのような)に再変換されて出力されなければなりません。そして普通の構成済みの書記素は望まれる出力に従ってNFCかNFDのどちらかの形式に変化します。

source: Maintaining a particular grapheme/id mapping over the life of the process may have some GC implications for long-running processes, but most processes will likely see a limited number of non-precomposed graphemes.
ja: 処理の期間にわたる特定の書記素/IDマッピングを扱うことは長期実行中のプロセスのためのいくつかのGC実装を持つかもしれません。しかし、おそらくほとんどのプロセスは限られた数の構成済みでない書記素を参照するでしょう。

source: If the program has a scope that wants a codepoint view rather than a grapheme view, the string visible to that lexical scope must also be translated to universal form, just as with output translation.
ja: もしプログラムが書記素表示よりもコードポイント表示を望むスコープを持つなら、そのレキシカルスコープに見える文字列もまた出力変換と同時に普遍的な形式に変換されなければなりません。

source: Alternately, the temporary grapheme ids may be hidden behind an abstraction layer.
ja: 代わりに、テンポラリ書記素IDは抽象化レイヤーから隠されるでしょう。

source: In any case, codepoint scope should never see any temporary grapheme ids.
ja: どんな場合でも、コードポイントスコープはどのようなテンポラリ書記素IDも参照しないべきです。

source: (The lexical codepoint declaration should probably specify which normalization form it prefers to view strings under.
ja: (レキシカルコードポイント宣言はおそらく文字列を見下ろすことを好む正規化形式を指定するべきです。

source: Such a declaration could be applied to input translation as well.)
ja: このような宣言は入力変換にも同様に適用できます。)

source: A Buf is a stringish view of an array of integers, and has no Unicode or character properties without explicit conversion to some kind of Str.
ja: Bufは整数配列の文字列的な見方です。そしていくつかの種類のStrへ明示的な変換がなければユニコードまたは文字のプロパティを持ちません。

source: (A buf is the native counterpart.) Typically it's an array of bytes serving as a buffer.
ja: (bufはネイティブに相当するものです。)通常、それはバッファとして供給するバイト配列です。

source: Bitwise operations on a Buf treat the entire buffer as a single large integer.
ja: Bufのビット単位演算はバッファ全体を一つの巨大な整数として扱います。

source: Bitwise operations on a Str generally fail unless the Str in question can provide an abstract Buf interface somehow.
ja: 問題になっているStrがBufの抽象インターフェースをどうにかして提供しなければ、Strのビット単位演算は普通は失敗します。

source: Coercion to Buf should generally invalidate the Str interface.
ja: Bufへの強制は一般的にはStrのインターフェースを無効にするべきです。

source: As a generic type Buf may be instantiated as (or bound to) any of buf8, buf16, or buf32 (or to any type that provides the appropriate Buf interface), but when used to create a buffer Buf defaults to buf8.
ja: ジェネリック型としてのBufはbuf8、buf16、buf32のどれか(またはBufの適切なインターフェースを提供する何らかの型)によってインスタンス化（またはバインド）されます。バッファとして使われる場合、Bufのデフォルトはbuf8になります。

source: Unlike Str types, Buf types prefer to deal with integer string positions, and map these directly to the underlying compact array as indices.
ja: Str型と異なり、Buf型は整数の文字列ポジションで処理することを好みます。そしてそれらをインデックスとして直接に基本的なコンパクト配列にマップします。

source: That is, these are not necessarily byte positions--an integer position just counts over the number of underlying positions, where one position means one cell of the underlying integer type.
ja: それは必ずしもバイトポジションである必要はありません―整数ポジションは単にあるポジションがある基本的な整数型のセルを意味する基本的なポジションの数を数えるだけです。

source: Builtin string operations on Buf types return integers and expect integers when dealing with positions.
ja: Buf型のビルトイン文字列操作は整数を返し、ポジションを処理する時には整数を期待します。

source: As a limiting case, buf8 is just an old-school byte string, and the positions are byte positions.
ja: 限られた場合として、buf8はただの古い習慣のバイト文字列で、ポジションはバイトポジションです。

source: Note, though, that if you remap a section of buf32 memory to be buf8, you'll have to multiply all your positions by 4.
ja: ただし、buf32のメモリのセクションをbuf8に再マップするなら全てのポジションを4倍する必要があるので注意して下さい。

source: The utf8 type is derived from buf8, with the additional constraint that it may only contain validly encoded UTF-8.
ja: utf8型はbuf8型から派生し、正当にエンコードされたUTF-8だけを含むという追加の制約を伴います。

source: Likewise, utf16 is derived from buf16, and utf32 from buf32.
ja: 同様にutf16はbuf16から派生し、utf32はbuf32から派生します。

source: Note that since these are type names, parentheses must always be used to call them as coercers, since the listop form is not allowed for coercions.
ja: これらは型名であり、制約にリスト演算形式は認められないので、それらを制約として呼び出すためには括弧を使う必要があるので注意して下さい。

source: That is:
ja: つまり:

source: is always parsed as
ja: は常に次のように解析されます。

source: and never as
ja: そして以下のようにはなりません。

source: The * character as a standalone term captures the notion of "Whatever", which is applied lazily by whatever operator it is an argument to.
ja: 単項としての文字*は“何でも”という概念を引き受けます。それは引数に対するwhatever演算子によっていいかげんに適用されます。

source: Generally it can just be thought of as a "glob" that gives you everything it can in that argument position.
ja: 一般的に、それは引数のポジションに何でも与える“glob”と考えることが出来ます。

source: For instance:
ja: 例えば:

source: Whatever is an undefined prototype object derived from Any.
ja: WhateverはAnyから派生した未定義のプロトタイプオブジェクトです。

source: As a type it is abstract, and may not be instantiated as a defined object.
ja: 型としては抽象型で、定義されたオブジェクトとしてインスタンス化されません。
